In [335]:
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [336]:
my_dataset = {
    'iphones': ["one", "two", "three", "four" ],
    'year':[2000, 2001, 2002, 2003]
}
my_var = pd.DataFrame(my_dataset)
print(my_var)

  iphones  year
0     one  2000
1     two  2001
2   three  2002
3    four  2003

In [337]:
#create a simple pandas series from a dictionary: for days and dates
data = {'Monday': '2023-07-03',
        'Tuesday': '2023-07-04',
        'Wednesday': '2023-07-05',
        'Thursday': '2023-07-06'}
series = pd.Series(data)
print(series)

Monday       2023-07-03
Tuesday      2023-07-04
Wednesday    2023-07-05
Thursday     2023-07-06
dtype: object

In [338]:
#create a series using only data from Monday and Tuesday
data = {'Monday': '2023-07-03',
        'Tuesday': '2023-07-04',
        'Wednesday': '2023-07-05',
        'Thursday': '2023-07-06'}

# Filter the dictionary to get data for Monday and Tuesday
filtered_data = {key: value for key, value in data.items() if key in ['Monday', 'Tuesday']}
series = pd.Series(filtered_data)
print(series)

Monday     2023-07-03
Tuesday    2023-07-04
dtype: object

In [339]:
#mine dataset
#Analyzing Data / Cleaning Data Exercise
#You are required to use some of the methods below to analyze and clean your data namely;

In [340]:
#1.Head()
df = pd.read_csv('mine.csv')
# View the first few rows of the data using head()
df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [341]:
#2.Tail()
# View the last few rows of the data using tail()
df.tail()

     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [342]:
#3.info()
# Get information about the DataFrame using info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [343]:
#4.Dropna()
# Drops rows with any missing values
df.dropna()

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

In [344]:
#Dropna()
# Drops columns with any missing values
df.dropna(axis=1)

     Duration  Pulse  Maxpulse
0          60    110       130
1          60    117       145
2          60    103       135
3          45    109       175
4          45    117       148
..        ...    ...       ...
164        60    105       140
165        60    110       145
166        60    115       145
167        75    120       150
168        75    125       150

[169 rows x 3 columns]

In [345]:
#5.fillna()
# Fill missing values with a specified value
df_filled = df.fillna(value=0)

# Fill missing values with the mean of each column
df_filled = df.fillna(df.mean())

# Forward fill missing values (carry the last observed value forward)
df_filled = df.fillna(method='ffill')

# Backward fill missing values (carry the next observed value backward)
df_filled = df.fillna(method='bfill')

In [346]:
#Also use the appropriate methods to remove;
#1. Wrong data
# Drop rows with wrong data based on a condition using isin()
df = df[~df['Duration'].isin(['hour'])]
print(df)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [347]:
# Replace wrong values with correct values using replace()
df['Duration'].replace({'hour': '60'}, inplace=True)
print(df['Duration'])

0      60
1      60
2      60
3      45
4      45
       ..
164    60
165    60
166    60
167    75
168    75
Name: Duration, Length: 169, dtype: int64

In [348]:
#2.wrong formats 
# Convert a column to numeric type, replacing invalid values with NaN
df['Calories'] = pd.to_numeric(df['Calories'], errors='coerce')
print(df['Calories'])

0      409.1
1      479.0
2      340.0
3      282.4
4      406.0
       ...
164    290.8
165    300.0
166    310.2
167    320.4
168    330.4
Name: Calories, Length: 169, dtype: float64

In [349]:
# Drop rows with NaN values in the numeric column
df = df.dropna(subset=['Calories'])
print(df)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

In [350]:
#3.duplicates
# Identify duplicate rows in the DataFrame
duplicate_rows = df[df.duplicated()]

# Remove duplicate rows from the DataFrame
df = df.drop_duplicates()

In [351]:
# Identify duplicates based on specific columns
duplicate_rows = df[df.duplicated(subset=['Duration', 'Pulse'])]

# Remove duplicates based on specific columns
df = df.drop_duplicates(subset=['Duration', 'Pulse'])

In [352]:
#4.perform some correlation on data
correlation_matrix = df.corr()
print(correlation_matrix)

          Duration     Pulse  Maxpulse  Calories
Duration  1.000000 -0.162308  0.011016  0.931728
Pulse    -0.162308  1.000000  0.804219  0.002308
Maxpulse  0.011016  0.804219  1.000000  0.188507
Calories  0.931728  0.002308  0.188507  1.000000

In [353]:
#Work dataset
#Analyzing Data / Cleaning Data Exercise
#You are required to use some of the methods below to analyze and clean your data namely;

In [354]:
#1.Head()
df2 = pd.read_csv('Work.csv')
# View the first few rows of the data using head()
df2.head()

     Name         city  age py-score
0    Emma      Kampala   23       90
1  Wilber        Mbale   26       75
2   Robin         Gulu   25     mine
3   Tevor  Livingstone  NaN       89
4    Yeko       Tororo   20       94

In [355]:
#2.Tail()
# View the last few rows of the data using tail()
df2.tail()

     Name         city    age py-score
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

In [356]:
#3.info()
# Get information about the DataFrame using info()
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      7 non-null      object
 1   city      7 non-null      object
 2   age       6 non-null      object
 3   py-score  6 non-null      object
dtypes: object(4)
memory usage: 352.0+ bytes

In [357]:
#4.Dropna()
# Drops rows with any missing values
df2.dropna()

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
2   Robin     Gulu  25     mine
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

In [358]:
#Dropna()
# Drops columns with any missing values
df2.dropna(axis=1)

     Name         city
0    Emma      Kampala
1  Wilber        Mbale
2   Robin         Gulu
3   Tevor  Livingstone
4    Yeko       Tororo
5  Miriam         Arua
6   Jesca      Mbarara

In [359]:
#5.fillna()
# Fill missing values with a specified value
df2_filled = df2.fillna(value=0)

# Forward fill missing values (carry the last observed value forward)
df2_filled = df2.fillna(method='ffill')

# Backward fill missing values (carry the next observed value backward)
df2_filled = df2.fillna(method='bfill')

In [360]:
#1.wrong data
#Also use the appropriate methods to remove;
# Replace wrong values with correct values using replace()
df2['age'].replace({'Train': 'NaN'}, inplace=True)
df2['py-score'].replace({'mine': 'NaN'}, inplace=True)

In [361]:
# Drop rows with wrong data based on a condition using isin()
df2 = df2[~df2['city'].isin(['Livingstone'])]
print(df2)

     Name     city  age py-score
0    Emma  Kampala   23       90
1  Wilber    Mbale   26       75
2   Robin     Gulu   25      NaN
4    Yeko   Tororo   20       94
5  Miriam     Arua  NaN      NaN
6   Jesca  Mbarara   21       84

In [362]:
#2.wrong formats 
# Convert a column to numeric type, replacing invalid values with NaN
df2['age'] = pd.to_numeric(df2['age'], errors='coerce')
print(df2['age'])

0    23.0
1    26.0
2    25.0
4    20.0
5     NaN
6    21.0
Name: age, dtype: float64

In [363]:
# Drop rows with NaN values in the numeric column
df2 = df2.dropna(subset=['age', 'py-score'])
print(df2)

     Name     city   age py-score
0    Emma  Kampala  23.0       90
1  Wilber    Mbale  26.0       75
2   Robin     Gulu  25.0      NaN
4    Yeko   Tororo  20.0       94
6   Jesca  Mbarara  21.0       84

In [364]:
#3.duplicates
# Identify duplicate rows in the DataFrame
duplicate_rows = df2[df2.duplicated()]

# Remove duplicate rows from the DataFrame
df2 = df2.drop_duplicates()

In [365]:
# Identify duplicates based on specific columns
duplicate_rows = df2[df2.duplicated(subset=['age', 'py-score'])]

# Remove duplicates based on specific columns
df2 = df2.drop_duplicates(subset=['age', 'py-score'])

In [366]:
#4.perform some correlation on data
correlation_matrix = df2.corr(numeric_only=True)
print(correlation_matrix)

     age
age  1.0